# Competition "Freebies, come!"
Решение 5 несложных, но увлекательных задач по программированию в рамках соревнования: "Халява, приди!".  
<https://codenrock.com/contests/halyava-pridi/>  

1. [Простые числа](#простые-числа)
2. 

## Простые числа
### Задание
Преподаватель по матанализу очень спешил на свидание, поэтому решил сократить число студентов, сдающих ему зачет. Он последовательно присвоил каждому студенту порядковый номер от 1 до N, где N - количество студентов, и сказал: "У кого порядковый номер является простым числом, тот получает зачет АВТОМАТОМ!". Напишите программу, которая посчитает какое количество студентов получило зачет автоматом.

Предлагается использовать *Решето Эратосфена*, т.е. алгоритм нахождения простых чисел до заданного натурального числа путем постепенного отсеивания составных чисел. Алгоритм заключается в последовательной проверке делимости чисел на предстоящие простые числа. Сначала берется первое простое и из ряда натуральных чисел высеиваются все кратные ему. Затем берется следующее простое и отсеиваются все кратные ему и так далее.

**Формат входных данных:** на вход программе подается одно целое положительное число (общее количество студентов)  
**Формат выходных данных:** программа должна вывести целое положительное число (количество простых чисел в последовательности от 1 до N, причем 1 не является простым числом)  

**Пример данных:**  
*Input 1:* 10  
*Output 1:* 4  

*Input 2:* 19  
*Output 2:* 8  

### Код (count_prime.py)
```python
import sys

def sieve(N):
    nums = [i for i in range(N+1)]
    nums[1] = 0
    i = 2
    while i <= N:
        if nums[i] != 0:
            for j in range(i+i, N+1, i):
                nums[j] = 0
        i += 1
    return [i for i in nums if i != 0]

if __name__ == '__main__':
    for line in sys.stdin:
        print(len(sieve(int(line))))
```
