# Competition "Freebies, come!"
Решение 5 несложных, но увлекательных задач по программированию в рамках соревнования: "Халява, приди!".  
<https://codenrock.com/contests/halyava-pridi/>  

1. [Простые числа](#простые-числа)
2. [Последовательность Фибоначчи](#последовательность-фибоначчи)
3. [Избыточные числа](#избыточные-числа)
4. [Сумма неповторяющихся](#сумма-неповторяющихся)
5. [Ёлка](#ёлка)

## Простые числа
### Задание
Преподаватель по матанализу очень спешил на свидание, поэтому решил сократить число студентов, сдающих ему зачет. Он последовательно присвоил каждому студенту порядковый номер от 1 до N, где N - количество студентов, и сказал: "У кого порядковый номер является простым числом, тот получает зачет АВТОМАТОМ!". Напишите программу, которая посчитает какое количество студентов получило зачет автоматом.  

Предлагается использовать *Решето Эратосфена*, т.е. алгоритм нахождения простых чисел до заданного натурального числа путем постепенного отсеивания составных чисел. Алгоритм заключается в последовательной проверке делимости чисел на предстоящие простые числа. Сначала берется первое простое и из ряда натуральных чисел высеиваются все кратные ему. Затем берется следующее простое и отсеиваются все кратные ему и так далее.  

**Формат входных данных:** на вход программе подается одно целое положительное число (общее количество студентов)  
**Формат выходных данных:** программа должна вывести целое положительное число (количество простых чисел в последовательности от 1 до N, причем 1 не является простым числом)  

**Пример данных:**  
*Input 1:* 10  
*Output 1:* 4  
*Input 2:* 19  
*Output 2:* 8  

### Код (count_prime.py)
```python
import sys

def sieve(N):
    nums = [i for i in range(N+1)]
    nums[1] = 0
    i = 2
    while i <= N:
        if nums[i] != 0:
            for j in range(i+i, N+1, i):
                nums[j] = 0
        i += 1
    return [i for i in nums if i != 0]

if __name__ == '__main__':
    for line in sys.stdin:
        print(len(sieve(int(line))))
```

## Последовательность Фибоначчи
### Задание
Посчитайте сумму нечетных чисел последовательности Фибоначчи размерности N. Последовательностью Фибоначчи называется последовательность, в которой каждое число является суммой двух предыдущих: 1, 1, 2, 3, 5, 8, 13... Договоримся что первый и второй элемент последовательности равны единицы.  

**Пример данных:**  
*Input 1:* 5  
*Output 1:* 10  
*Input 2:* 10  
*Output 2:* 99  

### Код (sum_not_even_fib.py)
```python

```

## Избыточные числа
### Задание
Проверить, является ли модуль максимальной разницы элементов списка избыточным числом. Избыточное число - это число, для которого сумма его собственных делителей больше, чем само число.  

**Формат входных данных:** на вход программе подается строка (целые числа разделённые пробелом)  
**Формат выходных данных:** программа должна вывести True, если модуль максимальной разницы элементов списка является избыточным числом, в противном случае False  

**Пример данных:**
*Input 1:* 11 -12 21 -21 -12 10 42 -12 -21 93 7  
*Output 1:* True  
*Input 2:* 43 -54 54 -23 65 132  
*Output 2:* True  

### Код (abundant_difference.py)
```python

```

## Сумма неповторяющихся
### Задание
Посчитайте сумму элементов в списке, которые встречаются только один раз, за исключением элементов с нулевым и последним индексом. Подсказка: исключение элементов с нулевым и последним индексом производится до сортировки элементов которые встречаются только один раз.  

**Формат входных данных:** на вход программе подается строка (целые числа разделённые пробелом)  
**Формат выходных данных:** программа должна вывести целое число  

**Пример данных:**
*Input 1:* 342 324 654 2333 43 43  
*Output 1:* 3354  
*Input 2:* 58 54 -98 98 -54 47 83 652 83 98 3  
*Output 2:* 601  

### Код (sum_lst.py)
```python

```

## Ёлка
### Задание
В предвкушении нового года преподаватель по программированию попросил студентов первого курса нарисовать ёлку высотой N. На вход подаётся целое положительное число, нарисуйте ёлку, в соответствии с тестовыми условиями.

**Пример данных:**  
*Input 1:* 3  
*Output 1:*  
*  
**  
***  

### Код (сhristmas_tree.py)
```python

```
